Offwind.App/Offwind.Wpf/Templates/fastDuct/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    bottom
    {
      type cyclic;
    }
 
    top
    {
      type cyclic;
    }

    west
    {
      type zeroGradient;
    }

    east
    {
      type fixedValue;
      value uniform 0.0;
    }

    north
    {
      type cyclic;
    }

    south
    {
      type cyclic;
    }
}


// ************************************************************************* //
