Offwind.App/Offwind.Wpf/Templates/fastDuct/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat       raw;

surfaceFormat   vtk;

sets
(

);

surfaces
(

    constantPlane1
    {
        type            plane;    // always triangulated
        basePoint       (632.0 0 0);
        normalVector    (1 0 0);
    }

);

fields          ( bodyForceFAST );


// ************************************************************************* //
